const num = 12.4;

console.log(Math.round(num)); // заокруглює до цілого найблищого числа

console.log(Math.floor(num)); // заокруглює завжди до меншого значення

console.log(Math.ceil(num)); // закруглює завжди до більшого


console.log(Math.random()); // генерує випадкове число < 1

const test = '12.2px'; // 12.2

console.log(parseInt(test)); // перетворює число в іншу систему числення 
// в даному випадку нетипове використання на строці де даний метод при перетворенні 
// лишає число а строку відкидає

console.log(parseFloat(test)); // повертає значення з плаваючою комою 
// також відкидає все що не є числом

console.log(Math.pow(num, 5)); // підносить число до степені     base=число.  exponent=степень