const str = "Hello world";

console.log(str.length); // властивість строки

console.log(str.toLowerCase()); // метод робить всі букви маленькими

console.log(str.toUpperCase()); // метод робить всі букви великими

console.log(str.slice(6, 11)); // вирізає кусок строки від (6) включаючи (6) до (11) не включає (11)
// приймає відємні значення // можна задати один аргумент індекс, тоді вирізатиме від до кінця строки

console.log(str.substring(6, 11)); // вирізає кусок строки від (6) включаючи (6) до (11) не включає (11)
//не приймає відємні значення

console.log(str.substr(6, 5)); // вирізає від вказаного індексу (6) наступну кількість символів (5)

console.log(str.indexOf("H")); // знаходить індекс елемента у масиві 
// якщо не знаходить повертає -1

//.trim() -- забирає пробіли з обох кінців стрінги

//.replase(/-/g, "_") — змінює щось на інше всюди де знаходить в даній string ( -  on  _)

//.charAt(index) — створює і вертає підрядок, що міститиме лише один символ